In [1]:
import pandas as pd

In [2]:
jeopardy = pd.read_csv('jeopardy.csv')
print(jeopardy.head())
print(jeopardy.columns)
print(jeopardy.dtypes)

   Show Number    Air Date      Round                         Category  Value  \
0         4680  2004-12-31  Jeopardy!                          HISTORY   $200
1         4680  2004-12-31  Jeopardy!  ESPN's TOP 10 ALL-TIME ATHLETES   $200
2         4680  2004-12-31  Jeopardy!      EVERYBODY TALKS ABOUT IT...   $200
3         4680  2004-12-31  Jeopardy!                 THE COMPANY LINE   $200
4         4680  2004-12-31  Jeopardy!              EPITAPHS & TRIBUTES   $200

                                            Question      Answer
0  For the last 8 years of his life, Galileo was ...  Copernicus
1  No. 2: 1912 Olympian; football star at Carlisl...  Jim Thorpe
2  The city of Yuma in this state has a record av...     Arizona
3  In 1963, live on "The Art Linkletter Show", th...  McDonald's
4  Signer of the Dec. of Indep., framer of the Co...  John Adams
Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')
Show Number     int64
 Air Date      object
 Round         object
 Category      object
 Value         object
 Question      object
 Answer        object
dtype: object

In [3]:
# Rename the columns 

jeopardy.columns = ['show_number', 'air_date', 'round', 'category', 'value', 'question', 'answer']
print(jeopardy.head())

   show_number    air_date      round                         category value  \
0         4680  2004-12-31  Jeopardy!                          HISTORY  $200
1         4680  2004-12-31  Jeopardy!  ESPN's TOP 10 ALL-TIME ATHLETES  $200
2         4680  2004-12-31  Jeopardy!      EVERYBODY TALKS ABOUT IT...  $200
3         4680  2004-12-31  Jeopardy!                 THE COMPANY LINE  $200
4         4680  2004-12-31  Jeopardy!              EPITAPHS & TRIBUTES  $200

                                            question      answer
0  For the last 8 years of his life, Galileo was ...  Copernicus
1  No. 2: 1912 Olympian; football star at Carlisl...  Jim Thorpe
2  The city of Yuma in this state has a record av...     Arizona
3  In 1963, live on "The Art Linkletter Show", th...  McDonald's
4  Signer of the Dec. of Indep., framer of the Co...  John Adams

In [4]:
# Filter out the questions that contains all of the words in a list of words 

def filter_data(data, words): 
    filter = lambda x: all(word.lower() in x.lower() for word in words)
    return data.loc[data.question.apply(filter)]

In [5]:
list = ['king', 'england']
filter_data(jeopardy, list)

,show_number,air_date,round,category,value,question,answer
4953,3003,1997-09-24,Double Jeopardy!,"""PH""UN WORDS",$200,Both England's King George V & FDR put their s...,Philately (stamp collecting)
6337,3517,1999-12-14,Double Jeopardy!,Y1K,$800,"In retaliation for Viking raids, this ""Unready...",Ethelred
9191,3907,2001-09-04,Double Jeopardy!,WON THE BATTLE,$800,This king of England beat the odds to trounce ...,Henry V
11710,2903,1997-03-26,Double Jeopardy!,BRITISH MONARCHS,$600,"This Scotsman, the first Stuart king of Englan...",James I
13454,4726,2005-03-07,Jeopardy!,A NUMBER FROM 1 TO 10,$1000,It's the number that followed the last king of...,4
...,...,...,...,...,...,...,...
208295,4621,2004-10-11,Jeopardy!,THE VIKINGS,$600,In 1066 this great-great grandson of Rollo mad...,William the Conqueror
208742,4863,2005-11-02,Double Jeopardy!,BEFORE & AFTER,"$3,000",Dutch-born king who ruled England jointly with...,William of Orange roughy
213870,5856,2010-02-15,Double Jeopardy!,URANUS,$1600,In 1781 William Herschel discovered Uranus & i...,George III
216021,1881,1992-11-09,Double Jeopardy!,HISTORIC NAMES,$1000,"His nickname was ""Bertie"", but he used this na...",Edward VII
216789,5070,2006-09-29,Double Jeopardy!,ANCIENT HISTORY,$1200,This kingdom of England grew from 2 settlement...,Wessex

In [6]:
# Find mean of values 

new_value = lambda x: x.replace('$','').replace(',', '')
jeopardy.value = jeopardy.value.apply(new_value)
# find_na = jeopardy.value.isna().sum()
# print(find_na)
jeopardy['new_value'] = pd.to_numeric(jeopardy.value, errors = 'coerce')
mean_value = jeopardy.new_value.mean()
print(mean_value)
#jeopardy = jeopardy[jeopardy.new.apply(lambda x: float(x))]

752.5959230365314

In [7]:
# Find the difficulty of topics 

# new_list = ['king']
# king_filter = filter_data(jeopardy, new_list)

# print(king_filter.new_value.mean())

def difficulty(list): 
    filter_jeopardy = filter_data(jeopardy, list)
    return(filter_jeopardy.new_value.mean())

In [9]:
list = ['math']
difficulty(list)

866.4705882352941

In [22]:
# Find unique answers to the questions including keyword 'king' and sort by their frequencies

# new_list = ['king']
# king_filter = filter_data(jeopardy, new_list)
# unique_answers = king_filter.answer.value_counts().reset_index()
# print(unique_answers)

# # Look for the frequency of the answer 'dragon'

# filter_answer = unique_answers.loc[unique_answers['index'].str.contains('dragon', case = False)]
# print(filter_answer)

                        index  answer
0                  Henry VIII      55
1                     Solomon      35
2                 Richard III      33
3                   Louis XIV      31
4                       David      30
...                       ...     ...
5263                 Heracles       1
5264   video display terminal       1
5265               unleavened       1
5266  Michael Jackson Pollock       1
5267                   slowly       1

[5268 rows x 2 columns]
                         index  answer
1260         Uther (Pendragon)       1
1672           Uther Pendragon       1
2273  How to Train Your Dragon       1
3191                  a dragon       1

In [29]:
# Filter the Unique Answers:

def filter_answer(topic, key): 
    topic_data = filter_data(jeopardy, topic) # filter the jeopardy data using the provided 'topic'
    unique_answers = topic_data.answer.value_counts().reset_index()
    filter_answer = unique_answers.loc[unique_answers['index'].str.contains(key, case = False)]
    return topic_data, filter_answer

In [31]:
filter_answer(['king'], 'dragon') # Note, the first entry needs to be in form of a list....

(        show_number    air_date             round                    category  \
 34             4680  2004-12-31  Double Jeopardy!                 "X"s & "O"s
 40             4680  2004-12-31  Double Jeopardy!  DR. SEUSS AT THE MULTIPLEX
 50             4680  2004-12-31  Double Jeopardy!  DR. SEUSS AT THE MULTIPLEX
 56             5957  2010-07-06         Jeopardy!               GEOGRAPHY "E"
 72             5957  2010-07-06         Jeopardy!                LET'S BOUNCE
 ...             ...         ...               ...                         ...
 216777         5070  2006-09-29  Double Jeopardy!             ANCIENT HISTORY
 216787         5070  2006-09-29  Double Jeopardy!    TALES OF E.T.A. HOFFMANN
 216789         5070  2006-09-29  Double Jeopardy!             ANCIENT HISTORY
 216856         5195  2007-03-23  Double Jeopardy!            HAIL TO THE CHEF
 216916         4999  2006-05-11  Double Jeopardy!                  QUOTATIONS

        value                                           question  \
 34       400  Around 100 A.D. Tacitus wrote a book on how th...
 40      1200  <a href="http://www.j-archive.com/media/2004-1...
 50      2000  <a href="http://www.j-archive.com/media/2004-1...
 56       200     It's the largest kingdom in the United Kingdom
 72       600  In this kid's game, you bounce a small rubber ...
 ...      ...                                                ...
 216777   400  The first one of these tombs was built about 2...
 216787  2000  A Hoffmann tale title lost the words "And The ...
 216789  1200  This kingdom of England grew from 2 settlement...
 216856  1600  You can cook like <a href="http://www.j-archiv...
 216916  2200  Oscar Wilde called this 4-letter word "the cur...

                                    answer  new_value
 34                                oratory      400.0
 40                                 Yertle     1200.0
 50                    Bartholomew Cubbins     2000.0
 56                                England      200.0
 72                                  jacks      600.0
 ...                                   ...        ...
 216777  a pyramid (the pyramids accepted)      400.0
 216787                     The Nutcracker     2000.0
 216789                             Wessex     1200.0
 216856                       (Martin) Yan     1600.0
 216916                               work     2200.0

 [7409 rows x 8 columns],
                          index  answer
 1260         Uther (Pendragon)       1
 1672           Uther Pendragon       1
 2273  How to Train Your Dragon       1
 3191                  a dragon       1)